from audio import playSoundByFilename
from speech_synthesizer import text_to_speech

help_dict = {
    "main": "Вы находитесь в главном меню",
    "units_tests": "Вы находитесь в меню уроков и тестов. Джойстик вниз: перейти к следующему занятию. Вверх: к предыдущему занятию. Влево: выйти в главное меню. Вправо: начать выбранное занятие.",
    "unit": "",
    "test": "",
    "notes": "Вы находитесь в приложении Заметки. Джойстик вниз: перейти к следующей заметке. Вверх: к предыдущей заметке. Влево: выйти в главное меню. Вправо: прочитать заметку, а при выборе Новая заметка — создать заметку.",
    "alphabet": "Вы находитесь в приложении Азбука. Джойстик вниз: озвучить и вывести следующую букву. Вверх: предыдущую букву. Влево: выйти в главное меню. Вправо: повторить букву ещё раз.",
    "clock": "Вы находитесь в приложении Часы. Джойстик влево: выйти в главное меню.",
    "calculator": "Вы находитесь в приложении Калькулятор. Для ввода +,-,*,/ используйте первые буквы соответствующих операций (сложение, вычитание, умножение, деление). Джойстик вниз: скобка открывается. Вверх: скобка закрывается. Джойстик влево: выйти в главное меню. Вправо: вывести результат.",
}


def instantHelp(menuID):
    text_to_speech(help_dict[menuID])
